<a href="https://colab.research.google.com/github/filiptomczak/colab/blob/main/intro/pandas_series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [58]:
import pandas as pd
import numpy as np

In [59]:
s=pd.Series(data=[1,3,5,3,1])

s

0    1
1    3
2    5
3    3
4    1
dtype: int64

0    1
1    3
2    5
3    3
4    1
dtype: int64

In [60]:
s=pd.Series(data=[1.0,5,3,1],index=['a','b','c','d'], name='sample')

s

a    1.0
b    5.0
c    3.0
d    1.0
Name: sample, dtype: float64

a    1.0
b    5.0
c    3.0
d    1.0
Name: sample, dtype: float64

In [61]:
s=pd.Series(data=[1,np.nan,5,3,1])

s

0    1.0
1    NaN
2    5.0
3    3.0
4    1.0
dtype: float64

0    1.0
1    NaN
2    5.0
3    3.0
4    1.0
dtype: float64

In [62]:
s=pd.Series(data=[True,True,False])
s

0     True
1     True
2    False
dtype: bool

0     True
1     True
2    False
dtype: bool

In [63]:
s=pd.Series(data=np.arange(10,20),index=pd.date_range(start='20250101',periods=10))
s

2025-01-01    10
2025-01-02    11
2025-01-03    12
2025-01-04    13
2025-01-05    14
2025-01-06    15
2025-01-07    16
2025-01-08    17
2025-01-09    18
2025-01-10    19
Freq: D, dtype: int64

2025-01-01    10
2025-01-02    11
2025-01-03    12
2025-01-04    13
2025-01-05    14
2025-01-06    15
2025-01-07    16
2025-01-08    17
2025-01-09    18
2025-01-10    19
Freq: D, dtype: int64

In [64]:
s=pd.Series(data=['p','c','s'],name='langs')
s

0    p
1    c
2    s
Name: langs, dtype: object

0    p
1    c
2    s
Name: langs, dtype: object

In [65]:
s.index
s.values
s.dtypes
s.shape

(3,)

(3,)

In [66]:
price=pd.Series(data={'apple':200, 'cdp':60, 'amazon':300})
price

apple     200
cdp        60
amazon    300
dtype: int64

apple     200
cdp        60
amazon    300
dtype: int64

In [67]:
price.cdp

np.int64(60)

np.int64(60)

In [68]:
price.count()

np.int64(3)

np.int64(3)

In [69]:
price.value_counts()

200    1
60     1
300    1
Name: count, dtype: int64

200    1
60     1
300    1
Name: count, dtype: int64

In [70]:
price.sum()

np.int64(560)

np.int64(560)

In [71]:
price.describe()

count      3.000000
mean     186.666667
std      120.554275
min       60.000000
25%      130.000000
50%      200.000000
75%      250.000000
max      300.000000
dtype: float64

count      3.000000
mean     186.666667
std      120.554275
min       60.000000
25%      130.000000
50%      200.000000
75%      250.000000
max      300.000000
dtype: float64

In [72]:
price.info()

<class 'pandas.core.series.Series'>
Index: 3 entries, apple to amazon
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      int64
dtypes: int64(1)
memory usage: 156.0+ bytes
<class 'pandas.core.series.Series'>
Index: 3 entries, apple to amazon
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      int64
dtypes: int64(1)
memory usage: 156.0+ bytes

In [73]:
price.nlargest(2)

amazon    300
apple     200
dtype: int64

amazon    300
apple     200
dtype: int64

In [74]:
price.rank()

apple     2.0
cdp       1.0
amazon    3.0
dtype: float64

apple     2.0
cdp       1.0
amazon    3.0
dtype: float64

In [75]:
price.sort_values()

cdp        60
apple     200
amazon    300
dtype: int64

cdp        60
apple     200
amazon    300
dtype: int64

In [77]:
price_pln=price.apply(lambda x: x*3.7)

In [78]:
price_pln

apple      740.0
cdp        222.0
amazon    1110.0
dtype: float64